<a href="https://colab.research.google.com/github/bikas1012/Term-2/blob/master/Capston2HR.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!pip install mysql.connector

Collecting mysql.connector
  Downloading https://files.pythonhosted.org/packages/28/04/e40098f3730e75bbe36a338926f566ea803550a34fb50535499f4fc4787a/mysql-connector-2.2.9.tar.gz (11.9MB)
     |████████████████████████████████| 11.9MB 8.4MB/s
Building wheels for collected packages: mysql.connector
  Building wheel for mysql.connector (setup.py) ... done
  Created wheel for mysql.connector: filename=mysql_connector-2.2.9-cp36-cp36m-linux_x86_64.whl size=247950 sha256=d5c023152c675a430da079b1abbe01b5e5e4bce670e74852d7b74e48c70bd7b1
  Stored in directory: /root/.cache/pip/wheels/8c/83/a1/f8b6d4bb1bd6208bbde1608bbfa7557504bed9eaf2ecf8c175
Successfully built mysql.connector
Installing collected packages: mysql.connector
Successfully installed mysql.connector

In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from matplotlib.pyplot import pie, axis, show
%matplotlib inline

In [4]:
from mysql.connector import Error

In [5]:
import mysql.connector

In [6]:
try:
   connection = mysql.connector.connect(host='cpanel.insaid.co', database='Capstone2', user='student',password='student')

   if connection.is_connected():
     db_info = connection.get_server_info()
     print("connected to MySQ Server version", db_info)
     sql_department_data = "select * from department_data"
     sql_employee_details_data = "select * from employee_details_data"
     sql_employee_data = "select * from employee_data"
    
     cursor = connection.cursor()
     cursor.execute(sql_department_data)
     record = cursor.fetchall()
     department_data_train = pd.DataFrame(record)
     
     cursor.execute(sql_employee_details_data)
     record1 = cursor.fetchall()
     employee_details_data = pd.DataFrame(record1)

     cursor.execute(sql_employee_data)
     record2 = cursor.fetchall()
     employee_data = pd.DataFrame(record2)
 
except Error as e :
  print ("Error while connecting  to MySQL", e)

finally :
  if (connection.is_connected()) :
    cursor.close()
    connection.close()
    print("MySQL connection is closed")

connected to MySQ Server version 5.6.49-cll-lve
MySQL connection is closed

In [7]:
connection

In [8]:
department_data_train.head()

         0            1                      2
0   D00-IT           IT             Henry Adey
1   D00-SS        Sales        Edward J Bayley
2   D00-TP         Temp        Micheal Zachrey
3  D00-ENG  Engineering  Sushant Raghunathan K
4   D00-SP      Support         Amelia Westray

In [9]:
employee_details_data.head()

        0   1       2          3
0  113558  43    Male    Married
1  112256  24  Female  Unmarried
2  112586  22  Female  Unmarried
3  108071  36    Male    Married
4  116915  38    Male    Married

In [10]:
employee_data.head()

       0       1     2         3   4   5       6         7     8     9       10
0  246.00    None  None  0.866838   6 NaN  medium  0.134415  Left  4.00  124467
1  134.00    None  None  0.555718   2 NaN     low  0.511041  Left  3.00  112210
2  156.00  D00-SS  1.00  0.474082   2 NaN  medium  0.405101  Left  3.00  126150
3  256.00  D00-SP  None  0.961360   6 NaN     low  0.152974  Left  4.00  125346
4  146.00  D00-SS  None  0.507349   2 NaN  medium  0.434845  Left  3.00  113707

In [11]:
employee_data.info

<bound method DataFrame.info of            0       1     2         3   ...        7         8     9       10
0      246.00    None  None  0.866838  ...  0.134415      Left  4.00  124467
1      134.00    None  None  0.555718  ...  0.511041      Left  3.00  112210
2      156.00  D00-SS  1.00  0.474082  ...  0.405101      Left  3.00  126150
3      256.00  D00-SP  None  0.961360  ...  0.152974      Left  4.00  125346
4      146.00  D00-SS  None  0.507349  ...  0.434845      Left  3.00  113707
...       ...     ...   ...       ...  ...       ...       ...   ...     ...
14145  245.00  D00-SS  None  0.850785  ...  0.225084  Employed  5.00  101809
14146  192.00  D00-SS  None  0.951901  ...  0.539834  Employed  3.00  116153
14147  175.00  D00-MN  None  0.854538  ...  0.934465  Employed  3.00  119780
14148  268.00  D00-MT  None  0.900887  ...  0.906613      Left  5.00  115325
14149  268.00  D00-IT  1.00  0.897098  ...  0.459371  Employed  4.00  112312

[14150 rows x 11 columns]>